from other_function import *

code_value = {'081': 'int', '082': 'char', '083': 'string', '084': 'float',
              '085': 'double', '086': 'identity', '087': 'int', '088': 'int'}  # 编码对应的类型

code_ju = {'081': 'int', '082': 'char', '083': 'string', '084': 'float',
              '085': 'double', '087': 'int', '088': 'int'}  # 编码对应的类型

fu_zhi = {'=', '+=', '-=', '*=', '/=', '%=', '&=', '|=', '^=', '<<=', '>>='}  # 所有

fu_zhi2 = {'+=', '-=', '*=', '/=', '%=', '&=', '|=', '^=', '<<=', '>>='}  # 拆成两步

cal = {'+', '-', '*', '/', '%'}  # 不能用字符作为操作数

wei_op = {'&', '|', '^', '<<', '>>', '~'}  # 不能用字符和浮点数作为操作数

priority = {'++': 1, '--': 1, '!': 1, '~': 1, '*': 2, '/': 2, '%': 2, '+': 3, '-': 3, '<<': 4, '>>': 4,
            '>': 5, '>=': 5, '<': 5, '<=': 5, '!=': 6, '==': 6, '&': 7, '^': 8, '|': 9, '&&': 10,
            '||': 11, '=': 13, '+=': 13, '-=': 13, '*=': 13, '/=': 13, '%=': 13, '&=': 13, '|=': 13,
            '^=': 13, '<<=': 13, '>>=': 13, '(': 14}

value_t = ['int', 'float', 'char', 'string', 'double']  # 定义变量类型

exp_code = {
    "calculation_expression": "算术表达式",
    "relation_expression": "关系表达式",
    "bool_expression": "布尔表达式",
    "wei_expression": "位运算表达式",
    "yiwei_expression": "移位运算表达式",
    "one_op": "自增运算式",
    "call_func": "函数调用",
    "fuzhi_expression": "赋值表达式"
}

have_d = []  # 表达式间已经定义的变量名

have_called = []  # 已经调用的函数名，最后判断是否定义

num_exp = {1: ''}

add_end = {'int': 1, 'char': '1', 'string': "11", 'double': 1.1, 'float': 1.1, 'void': ''}

'''x = ('char', '076', '0', '0')'''
